IDEA Open Model
IAppController Interface
 Enables controlling of the application IdeaConnection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public interface IAppController
Public Interface IAppController
public interface class IAppController
The IAppController type exposes the following members.
Methods
Name | Description
GetConnectionData
GetIdeaConnectionProject
OpenIdeaConnection
 Opens the application Idea Connection and waits till this application is closed
OpenIdeaConnectionService
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace